# -*- coding: utf-8 -*-
"""
1. list와 유사한 deque 구조의 이해
2. list보다 연산속도가 빠름
→ df의 columns을 통한 df의 구조 변경시 활용하면 편함
"""
###############################################################
from collections import deque
###############################################################3
a = [1, 2, 3, 4, 5]

q = deque(a)
q.rotate(2)  #시계방향 회전은 양수, 그 반대는 음수
q.rotate(-2)  #시계방향 회전은 양수, 그 반대는 음수
result = list(q)
###############################################################3
d.append(6)        # 오른쪽 추가
d.appendleft(0)    # 왼쪽 추가

d.pop()            # 오른쪽 제거
d.popleft()        # 왼쪽 제거
###############################################################3