# -*- coding: utf-8 -*-
"""
□ 판다스에서 조건에 맞는 행의 특정 칼럼 데이터 수정(loc)
→ 이전까지 조건을 걸어서 행을 추출하는데 자주 활용했었고, if와 for을 통해서 변경하기도 했으나,
  loc의 이해가 깊어지고 난 후에 아래와 같이 전처리를 실시함
참고: https://wikidocs.net/122727
"""
#--------------------------------------------------------
import pandas as pd
import numpy as np
#--------------------------------------------------------
# 판다스에서 행 데이터 수정 ★★★
d = {'이름': ['이서연', '김민준'], '국어점수': [70, 80], '수학점수': [80, 70]}
df = pd.DataFrame(data=d)
df.loc[df['이름'] == '이서연', ('국어점수')] = 100
print(df)

d = {'이름': ['이서연', '김민준'], '국어점수': [70, 80], '수학점수': [80, 70]}
df = pd.DataFrame(data=d)
df.loc[df['이름'] == '이서연', ('국어점수', '수학점수')] = (100, 50)
print(df)
#--------------------------------------------------------
# 데이터프레임 만들기(dict, np.array)
d = {'이름': ['이서연', '김민준'], '국어점수': [70, 80], '수학점수': [80, 70]} # dict
df = pd.DataFrame(data=d)
print(df)

df = pd.DataFrame(np.array([['이서연', 70, 80], ['김민준', 80, 70]]), columns=['이름', '국어점수', '수학점수']) # np.array
print(df)
#--------------------------------------------------------